[frmMain]
mnuLanguage.Caption=言語(Language)

pmnuExitTheSystem.Caption=システムを終了

mnuSystemSettings.Caption=システム設定
mnuParameterSetting.Caption=パラメータ設定
mnuBootUp.Caption=起動
mnuExitTheSystem.Caption=システムを終了

mnuReportTools.Caption=レポートツール
mnuReportDesign.Caption=レポートのデザイン

mnuPrintLog.Caption=印刷ログを表示


mnuJsonTools.Caption=Json効果ツール(bejson.com)
mnuBase64.Caption=base 64とピクチャーは互いに転換します。
mnuUrlEncode.Caption=URLコード/デコード
mnuSSLTools.Caption=SSL証明書フォーマット変換ツール
mnuOpenTheRootDirectory.Caption=ルートディレクトリを開く
mnuOpenReportDirectory.Caption=レポートディレクトリを開く
mnuOpenLogDirectory.Caption=ログディレクトリを開く
mnuOpenTheOutputfileDirectory.Caption=出力ファイルディレクトリを開く
mnuWindowDisplay.Caption=ウィンドウの表示
mnuHttpPrint.Caption=HTTP印刷
mnuMqttPrint.Caption=MQTT印刷
mnuCamera.Caption=カメラ
mnuIdCard.Caption=身分証
mnuGridreport.Caption=Gridreport
mnuFastreport.Caption=Fastreport
mnuReportmachine.Caption=Reportmachine
mnuSystemHelp.Caption=システムヘルプ
mnuAboutUs.Caption=私たちについて

ts_http_print.Caption=HTTP印刷
lblPort.Caption=ポート
rb_print.Caption=印刷
rb_Preview.Caption=プレビュー
ButtonStart.Caption=起動
ButtonStop.Caption=停止

ts_mqtt_print.Caption=MQTT印刷
gb_mqtt.Caption=MQTTサーバ
lbl_mqtt_server_address.Caption=住所
lbl_mqtt_server_port.Caption=ポート
lbl_mqtt_server_username.Caption=ユーザ名
lbl_mqtt_server_userpwd.Caption=パスワード
lbl_mqtt_server_subscribe_topic.Caption=テーマを購読
lbl_mqtt_server_print_verification_code.Caption=認証コードを印刷
ButtonStart_mqtt.Caption=起動
ButtonStop_mqtt.Caption=停止

ts_camera.Caption=カメラ
lbl_camera_device_list.Caption=デバイスリスト
lbl_camera_resolution.Caption=解像度
btn_open_camera.Caption=カメラを動かす
btn_close_camera.Caption=カメラを閉じる
chk_auto_open_camera.Caption=自動起動カメラ
chk_pal_b.Caption=フラッシュ防止
chk_auto_top.Caption=フォームの最前面へ移動

ts_idcard.Caption=身分証
lbl_idcard_name.Caption=名前
lbl_idcard_sex.Caption=性別
lbl_idcard_nation.Caption=民族
lbl_idcard_birthday.Caption=生年月日
lbl_idcard_id.Caption=身分証番号
lbl_idcard_org.Caption=発行機関
lbl_idcard_addr.Caption=住所
lbl_idcard_begin.Caption=有効期間開始
lbl_idcard_end.Caption=有効期間終了
lbl_idcard_type.Caption=デバイスのタイプ
btn_idcard_read.Caption=読み込み
lbl_idcard_msg.Caption=メッセージ:

[frmAbout]
btnOk.Caption=を選択します
Caption=について

[LanguageString]
ini_NeedRegister=印刷回数が多すぎますので、印刷プラグインを再起動してください。またはOEM版を購入してください。
ini_NoToken=token値が存在しません
ini_ReadIdCardError=メッセージメッセージメッセージ:カードの読み取りに失敗しました。
ini_GetPrinterList=プリンタのリストを取得
ini_CreateDir=ディレクトリを作成
ini_FailPleaseCheck=失敗しました。確認してください
ini_PrintFailPleaseCheck=印刷に失敗しました。確認してください。
ini_ReportFileNotExist=レポートファイルは存在しません。
ini_DownLoadError=ダウンロードエラー
ini_JsonFormatError=Jsonフォーマットが間違っています
ini_PrintingTimeoutPleaseCheck=プリントアウトが超過しました。確認してください。
ini_PictureFormatError=画像のフォーマットが正しくありません。
ini_PdfFileNotExist=pdfファイルは存在しません
ini_PicFileNotExist=picファイルは存在しません
ini_This=これです
ini_NotSupport=サポートしない
ini_InterfaceCallFailed=インターフェースの呼び出しに失敗しました
ini_CameraNotActivated=カメラが起動していません
ini_SelectFolder=フォルダを選択
ini_MinutesMustBeAnInteger=分の数は整数でなければなりません。
ini_MinutesMustBeGreaterThanZero=分の数は必ず0より大きくしてください。
ini_SelfStartingClientNameCannotBeEmpty=クライアント名を起動してから空にすることはできません。


ini_PdfFileCannotOpen=pdfファイルを開けませんでした。
ini_LicenseKeyInvalid=ライセンス鍵が無効です。


ini_PicFileCannotOpen=picファイルを開けませんでした。
ini_UnableInitializePrinter=プリンタを初期化できませんでした。
ini_PicPrint=picプリント
ini_PaperSize=用紙サイズ
ini_CustomMM=カスタム(MM)
ini_Width=幅
ini_Height=高さ
ini_PrintingDirection=印刷方向
ini_landscape=横向き
ini_portrait=縦向き
ini_MarginMM=ページ余白(MM)
ini_Left=左
ini_Right=右側
ini_Top=上に移動
ini_Bottom=下へ
ini_Center=にある
ini_VerticalPos=垂直位置
ini_HorizontalPos=水平位置
ini_Copys=部数
ini_DocumentTitle=文書のタイトル
ini_PrinterName=プリンタ名
ini_PageZoom=ページの拡大縮小
ini_Normal=オリジナル画像DPIに基づいて印刷サイズ（すなわち、実サイズのコピーを作成する）を決定する。
ini_FitToPage=画像をページに合わせて拡大し、その比率を尊重します。
ini_FitToPageStretch=画像をページに合わせて拡大し、スケールを無視します。
ini_FillPage=画像を拡大してページ全体に塗りつぶします。
ini_SpecifiedSize=絶対幅と絶対高さパラメータで指定した絶対サイズで印刷します。
ini_MultiplePages=絶対幅と絶対高さのパラメータで指定したカウントを複数ページに印刷します。
ini_SpecWidth=絶対幅
ini_SpecHeight=絶対高さ
ini_LoadPic=画像を読み込む
ini_ConfirmPrinting=印刷確認




ini_PrintLog=ログを印刷
ini_Date=日付
ini_Refresh=更新
ini_OpenLogDirectory=ログディレクトリを開く
ini_OpenOutputFileDirectory=出力ファイルディレクトリを開く
ini_ViewCustomFile=カスタムファイルを表示
ini_LogList=ログリスト
ini_LogContent=ログの内容
ini_PdfFile=pdfファイル
ini_Directory=目次
ini_NotExist=存在しない




ini_ReportDesign=レポートのデザイン
ini_DoubleClickToOpenTheReportFile=ダブルクリックしてレポートファイルを開くことができます。
ini_NewlyAdded=追加
ini_Modify=変更
ini_Delete=削除
ini_Copy=コピー
ini_ReportDoesNotExist=レポートは存在しません
ini_To=を選択します
ini_Error=エラー
ini_InTheListBelow_selectTheReportFileYouWantToModify=下のリストで、変更するレポートファイルを選択してください。
ini_TestReport=テストレポート
ini_AreYouSureYouWantToDelete=削除を確認しますか？
ini_DeleteConfirmation=削除の確認
ini_YouHaveChosenNotToDelete=選択しました。削除しないでください。
ini_ReportNameEn=レポート名(英語)
ini_ReportNameAlias=レポート名(エイリアス)
ini_VersionNumber=バージョン番号
ini_FileNameSuffixMustBe=ファイル名の拡張子は、
ini_Currently=現在
ini_TheFileNameAlreadyExists=このファイル名は既に存在します。
ini_ReportInfo=レポート情報




ini_NoJsonFile=jsonファイルがありません
ini_PrintErrorJsonError=印刷に失敗しました。jsonフォーマットが間違っています。
ini_MustBe=必須
ini_Or=または
ini_ReportName=レポート名
ini_CannotBeEmpty=暇ではない
ini_MustBeIntOrFloat=小数または整数の種類が必要です。
ini_DeleteLocalReportFile=ローカルレポートファイルを削除
ini_DownLoadReportFileToLocal=リモートレポートをローカルにダウンロード
ini_DownLoadReportFileError=レポートファイルのダウンロードエラー
ini_DownLoadComplete=ダウンロード完了
ini_EditLocalReportVersion=ローカルレポートのバージョン番号を変更します。
ini_CreateReportFile=レポートファイルを作成
ini_PrintCopys=印刷部数
ini_MustBeInt=整数の種類が必要です。
ini_MustBeGreaterThanOrEqualTo=ゼロ以上でなければなりません。
ini_DetermineIfThePrinterExists=プリンタの存在を判断する
ini_Printer=プリンタ
ini_NotExistPayAttentionToCaseAndSpace=存在しません。大文字と空欄に注意してください。
ini_SetRightOffset=右オフセットの設定
ini_MustBeFloat=浮動小数点のタイプでなければなりません。
ini_SetBottomOffset=ボトムオフセットの設定
ini_MustBeOneOrZero=1または0でなければなりません
ini_SetComponent=ウィジェットの枠を設定
ini_Component=ウィジェットボックス
ini_ControlToArrayError=Controlがarrayに変更されました。エラーが発生しました。
ini_LoadPicError=画像の読み込みエラー
ini_FormatError=フォーマットが間違っています
ini_Parameter=パラメータ
ini_ParameterToArrayError=パラメータがarrayに変更されました。エラーが発生しました。
ini_Field=フィールド
ini_FieldToArrayError=Fieldがarrayに変更されました。エラーが発生しました。
ini_AFieldToArrayError=AFieldがarrayに変更されました。エラーが発生しました。
ini_BFieldToArrayError=BFieldがarrayに変更されました。エラーが発生しました。
ini_CFieldToArrayError=CFieldがarrayに変更されました。エラーが発生しました。
ini_DFieldToArrayError=DFieldがarrayに変更されました。エラーが発生しました。
ini_EFieldToArrayError=EFieldがarrayに変更されました。エラーが発生しました。
ini_FFieldToArrayError=FFieldがarrayに変更されました。エラーが発生しました。
ini_GFieldToArrayError=GFieldがarrayに変更されました。エラーが発生しました。
ini_HFieldToArrayError=HFieldがarrayに変更されました。エラーが発生しました。
ini_IFieldToArrayError=IFieldがarrayに変更されました。エラーが発生しました。
ini_JFieldToArrayError=JFieldがarrayに変更されました。エラーが発生しました。
ini_DataRow=データ行
ini_DataToArrayError=Dataからarrayへの変換エラー
ini_ADataToArrayError=ADataがarrayに変更されました。エラーが発生しました。
ini_BDataToArrayError=BDataがarrayに変更されました。エラーが発生しました。
ini_CDataToArrayError=CDataがarrayに変更されました。エラーが発生しました。
ini_DDataToArrayError=DDataがarrayに変更されました。エラーが発生しました。
ini_EDataToArrayError=EDataがarrayに変更されました。エラーが発生しました。
ini_FDataToArrayError=FDataがarrayに変更されました。エラーが発生しました。
ini_GDataToArrayError=GDataがarrayに変更されました。エラーが発生しました。
ini_HDataToArrayError=HDataがarrayに変更されました。エラーが発生しました。
ini_IDataToArrayError=IDataがarrayに変更されました。エラーが発生しました。
ini_JDataToArrayError=JDataがarrayに変更されました。エラーが発生しました。
ini_SetOffsetValue=オフセット値を設定
ini_SetPrinterName=プリンタ名を設定
ini_ExportFileYes=ファイルをエクスポートするかどうか
ini_ExportFileName=ファイル名をエクスポート
ini_ExportComplete=エクスポート完了
ini_PreviewComplete=プレビュー終了
ini_PrintComplete=印刷済み
ini_LoadReport=レポートを読み込み
ini_ADataToArraySuccess=ADataからarrayに移行しました。成功しました。
ini_BDataToArraySuccess=BDataからarrayに移行しました。成功しました。
ini_CDataToArraySuccess=CDataからarrayに移行しました。成功しました。
ini_DDataToArraySuccess=DDataからarrayに移行しました。成功しました。
ini_EDataToArraySuccess=EDataからarrayに移行しました。成功しました。
ini_FDataToArraySuccess=FDataからarrayに移行しました。成功しました。
ini_GDataToArraySuccess=GDataからarrayに移行しました。成功しました。
ini_HDataToArraySuccess=HDataからarrayに移行しました。成功しました。
ini_IDataToArraySuccess=IDataからarrayに移行しました。成功しました。
ini_JDataToArraySuccess=JDataからarrayに移行しました。成功しました。




ini_NoClientID=clientidの値はありません
ini_ClientIDEmpty=clientidは空ではありません
ini_PrinteridWrong=printerridが間違っています
ini_PrinterpwdWrong=printerpwdが間違っています
ini_MethodWrong=methodが不正です
ini_PingSuccessful=ping成功
ini_PingTimeout=pingタイムアウト
ini_ConnectionResults=接続結果
ini_subscribeResultMessageID=購読結果、メッセージID
ini_UnsubscribeResultMessageID=購読結果をキャンセルします。メッセージID
ini_Received_release_confirmation_QoS_1_message_ID=リリース確認Qos 1を受け取りました。メッセージID
ini_Receive_release_confirmation_step_1_of_QoS_2_message_ID=リリース確認Qos 2受信第1ステップ、メッセージID
ini_Receive_release_confirmation_step_3_of_QoS_2_message_ID=リリース確認Qos 2第3ステップを受信しました。メッセージID
ini_Receive_release_confirmation_step_2_of_QoS_2_message_ID=リリース確認Qos 2を受信しました。メッセージID
ini_ConnectionTimedOut=接続タイムアウト
ini_PublishingTimeout=リリースタイムアウト
ini_MessageID=メッセージID
ini_Topic=テーマ
ini_Content=内容
ini_CameraOn=カメラが開きました
ini_OpenFailed=開けませんでした
ini_NoVideoDevicesWereFound=ビデオデバイスが見つかりませんでした。
ini_Stopped=停止しました
ini_CameraStartFailed=カメラの起動に失敗しました。
ini_CameraOff=カメラが閉じました
ini_Disconnect=接続を切断
ini_Started=起動しました
ini_Failed_to_start_Please_try_another_port=起動に失敗しました。ポートを変えてみてください。
ini_Minimum_desktop_requirements_Windows_Vista=デスクトップ版の最低要求：Windows Vista
ini_Minimum_server_requirements_Windows_Server_2008=サーバー最低要求：Windows Server 2008






ini_Table_structure_field_type=テーブル構造フィールドタイプftBlob（base64フォーマット）、ftString ftInteger ftBoolean、ftFloat、ft Currency、ftDateTime、
ini_size_ftString_ftInteger_ftBlob=Size（ftStringは実際の長さに設定され、他は0に設定されています。例えば、ftInteger ftBlobなどは0に設定されています。）
ini_Currently_10_tables_are_supported=現在は10表のABCDEFGHIJをサポートしています。例えば、表AはAield ADaaを含んでいます。JはJField JDataを含みます。



ini_ParameterSetting=パラメータ設定
ini_Log_save_path_if_empty_the_default_is_log_directory=ログ保存パス(デフォルトはlogディレクトリとして空です)
ini_Clear_log_on_startup=起動時にログをクリアします。
ini_Clear_log_on_exit=終了時にログを空にします。
ini_In_operation_every=運行中、XX分ごとに、一回をクリアします。
ini_Save_settings=設定を保存
ini_journal=ログ
ini_report_form=レポート
ini_Report_template_path_empty_default_report_directory=レポートテンプレートのパス(空のデフォルトのレポート)
ini_Export_file_path_empty_default_export_directory=ファイルのパスをエクスポートします。(デフォルトのexportディレクトリが空です。)
ini_Export_file_format_blank_default_PDF_format=ファイル形式をエクスポートします。標準のpdf形式が空です。
ini_Enable_token=tokenを有効にする
ini_Token_list_one_for_each_line_similar_to_white_list=tokenリスト（行1つ、ホワイトリストのようなもの）
ini_other=その他
ini_Minimize_after_startup=起動後最小化
ini_Customize_the_client_name_so_that_it_can_start_multiple_clients=クライアント名をカスタマイズして、複数のクライアントを起動させることができます。







ini_URL_encoding_decoding=URLコード/デコード
ini_URLEncode=UrlEnccodeコード
ini_URLDecode=Urldecodeデコード







ini_Base64_and_image_conversion=base 64とピクチャーは互いに転換します。
ini_exceed_100k=生産環境における効率を均衡させるために、一般的に単一の画像ファイルは100 Kを超えないでください。
ini_Base64_string=base 64文字列
ini_paste=貼り付け
ini_Turn_to_picture=画像に変換
ini_picture=画像






ini_Connection=接続
ini_write_log=ログの生成